docs/README.org
* Literate Emacs Configuration.

This is a really /opinionated/ configuration of GNU/Emacs.

** Emacs base configuration.

*** Directory structure.

The directory structure is set up in [[../init.el][init.el]].

- ~lec/cached-dir~ is the cached directory.
- ~lec/doc-dir~ is the directory where the documentation goes.
- ~lec/doc-file~ is this actual file.
- ~lec/tangled-doc-file~ is the output file for all tangled blocks from ~lec/doc-file~.

*** Configuration

**** early-init.el file.

Emacs 27.1 introduced early-init.el, which is run before init.el. Its main purpose here is to set GNU/Emacs with sane default to reflect the current configuration before loading everything. It prevent emacs to show in a non configured state.

As per GNU/Emacs >= 28, native compilation can be enabled, resulting in ~*.eln~  files populating a directory at the root of the configuration directory. Redirect eln-cache files into an appropriate directory.

#+begin_src emacs-lisp :tangle ../early-init.el
  (when (fboundp 'startup-redirect-eln-cache)
    (startup-redirect-eln-cache
     (expand-file-name "var/eln-cache/" user-emacs-directory)))
#+end_src

Disable the visual menus, the bell, the dialog boxes and suppress ~ad-handle-definition~ warnings.

#+begin_src emacs-lisp :tangle ../early-init.el
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (setq inhibit-startup-message t
        ring-bell-function 'ignore
        use-dialog-box nil
        ad-redefinition-action 'accept)
#+end_src

Set the frame (graphical window) name to the buffer name.

#+begin_src emacs-lisp :tangle ../early-init.el
  (setq-default frame-title-format '("%b"))
#+end_src

Simplify the ~yes~ / ~no~ answers with simples ~y~ or ~n~.

#+begin_src emacs-lisp :tangle ../early-init.el
  (fset 'yes-or-no-p 'y-or-n-p)
#+end_src

Set the different fonts.

#+begin_src emacs-lisp :tangle ../early-init.el
  (set-face-attribute 'default nil :font "FiraCode Nerd Font" :height 100)
  (set-face-attribute 'fixed-pitch nil :font "FiraCode Nerd Font" :height 100)
  (set-face-attribute 'variable-pitch nil :font "NotoSansDisplay Nerd Font" :height 100)
#+end_src

Change the colors for the background and foreground to respect the theme in use.

#+begin_src emacs-lisp :tangle ../early-init.el
  (add-to-list 'default-frame-alist '(foreground-color . "#d6d6d4"))
  (add-to-list 'default-frame-alist '(background-color . "#1c1e1f"))
#+end_src

Display a temporary helpful message in the modeline for the user.

#+begin_src emacs-lisp :tangle ../early-init.el
  (set-face-foreground 'mode-line "#d6d6d4")
  (set-face-background 'mode-line "#2d2e2e")
  (set-face-attribute 'mode-line nil :box nil)
  (set-face-attribute 'mode-line-inactive nil :box nil)
  (setq mode-line-format "Initializing Litterate Emacs Configuration (lec)...")
#+end_src

Change the scratch buffer initial major mode to ~Fundamental~ to speedup the initialization.

#+begin_src emacs-lisp :tangle ../early-init.el
  (setq initial-major-mode 'fundamental-mode)
  (setq initial-scratch-message nil)
#+end_src

Maximize the frame on startup.

#+begin_src emacs-lisp :tangle ../early-init.el
  (add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src

Disable the garbage collection and inibit the package initialization.

#+begin_src emacs-lisp :tangle ../early-init.el
  (setq gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 0.6
        native-comp-deferred-compilation t
        warning-minimum-level :error
        package-enable-at-startup nil
        package-quickstart nil
        load-prefer-newer noninteractive)
#+end_src

Set the locale and input method.

#+begin_src emacs-lisp :tangle ../early-init.el
  (set-language-environment "UTF-8")
  (setq default-input-method nil)
#+end_src

**** init.el file.

If emacs is not at least in version 27, manually load the early-init file.

#+begin_src emacs-lisp :tangle ../init.el
  (when (version< emacs-version "27")
    (message "Emacs version < 27 do not support early-init.el. Load it manually.")
    (load (concat
           (file-name-directory load-file-name)
           "early-init")
          'noerror 'nomessage))
#+end_src

Helper to concatenate path no matter if the entries end with a directory separator or not.

#+begin_src emacs-lisp :tangle ../init.el
  (if (featurep 'cl-lib)
      (require 'cl-lib)
    (require 'cl))

  (defun concat-path (&rest parts)
    (cl-reduce (lambda (a b) (expand-file-name b a)) parts))
#+end_src

Directory structure and documentation tangling related variables.

#+begin_src emacs-lisp :tangle ../init.el
  (defconst lec/etc-directory (concat-path user-emacs-directory "etc")
    "Directory where external configurations for packages goes.")

  (defconst lec/doc-directory (concat-path user-emacs-directory "docs")
    "Directory where literate configuration in org-mode lies.")

  (defconst lec/var-directory (concat-path user-emacs-directory "var")
    "Directory where temporary files and packages resources goes.")

  (defconst lec/doc-file (concat-path lec/doc-directory "README.org")
    "Documentation file for the configuration.")

  (defconst lec/tangled-doc-file (concat-path lec/var-directory "tangled-conf.el")
    "File destination for tangled code blocks from the documentation.")
#+end_src

Utilities functions related to the tangling of the files.

#+begin_src emacs-lisp :tangle ../init.el
  (defun lec/tangle-documentation ()
    "Tangle the org file given to cache directory after renaming it."
    (interactive)
    (require 'org)
    (org-babel-tangle-file lec/doc-file lec/tangled-doc-file))

  (defun lec/--tangle-current-documentation ()
    "If the the file currently edited is the documentation configuration, tangle
  the code blocks."
    (when (string-match lec/doc-file buffer-file-name)
      (lec/tangle-documentation)))

  (defun lec/--add-tangle-headers ()
    "Add headers at the start of tangled files specifying they should not be
  modified manually."
    (goto-char (point-min))
    (insert ";;; -*- lexical-binding: t -*-\n")
    (insert ";;; This file is automatically generated. Do not edit manually.\n")
    (insert ";;; See `docs/README.org' for the original source.\n\n")
    (save-buffer))
#+end_src

If the tangled configuration does not exists, tangle it.

#+begin_src emacs-lisp :tangle ../init.el
  (unless (file-exists-p lec/tangled-doc-file)
    (lec/tangle-documentation))
#+end_src

Hooks to tangle configuration when the documentation is modified. Also add headers to specify that these files should not be modified directly as they get rewritten each time the documentation is modified.

#+begin_src emacs-lisp :tangle ../init.el
  (add-hook 'after-save-hook #'lec/--tangle-current-documentation)
  (add-hook 'org-babel-post-tangle-hook #'lec/--add-tangle-headers)
#+end_src

Load the tangled configuration.

#+begin_src emacs-lisp :tangle ../init.el
  (load lec/tangled-doc-file)
#+end_src

And finally, specify a ~custom-file~ to load to avoid ~Customize~ options to rewrite this file.

#+begin_src emacs-lisp :tangle ../init.el
  (setq-default custom-file (concat-path lec/etc-directory "custom.el"))
  (load custom-file 'noerror 'nomessage)
#+end_src

*** Utility functions for GNU/Emacs configuration.

#+begin_src emacs-lisp
  (defun lec/reload-configuration ()
    "Reload emacs configuration."
    (interactive)
    (load-file user-init-file))

  (defun lec/--bufferp (buffer)
    "Predicate that return nil if the buffer-name start with one of the things
  to exclude, else t."
    (cond ((string-match "^*" (buffer-name buffer)) nil)
          ((string-match "^magit" (buffer-name buffer)) nil)
          (t t)))

  (set-frame-parameter nil 'buffer-predicate 'lec/--bufferp)
#+end_src

*TODO:* /Advice to temporarily fix deprecated macro signature in emacs >= 28. Remove this advice when the packages finally fix the changes./

Due to the recent changes in GNU/Emacs for the ~define-obsolete-function-alias~ function, requiring an extra parameter ~when~, a lot of packages issue warning and errors.

#+begin_src emacs-lisp
  (define-advice define-obsolete-function-alias (:filter-args (ll) fix-obsolete)
    (let ((obsolete-name (pop ll))
          (current-name (pop ll))
          (when (if ll (pop ll) "1"))
          (docstring (if ll (pop ll) nil)))
      (list obsolete-name current-name when docstring)))
#+end_src

** Emacs defaults.

*** Packages managment.

#+begin_src emacs-lisp
  (setq straight-base-dir lec/var-directory)
  (setq straight-repository-branch "develop")
  (setq comp-deferred-compilation-deny-list nil)
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" lec/var-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  ;; Install use-package
  (straight-use-package 'use-package)
  (setq use-package-always-ensure t)

  ;; Configure use-package to use straight-use-package transparently.
  (use-package straight
    :custom (straight-use-package-by-default t))
#+end_src

*** Benchmark emacs start-up.

#+begin_src emacs-lisp
  (use-package benchmark-init
    :config
    (require 'benchmark-init-modes) ; explicitly required
    (add-hook 'after-init-hook #'benchmark-init/deactivate))
#+end_src

*** Avoid littering temporary files everywhere.

#+begin_src emacs-lisp
  (use-package no-littering
    :custom
    (no-littering-etc-directory lec/etc-directory)
    (no-littering-var-directory lec/var-directory))
#+end_src

*** Base emacs configuration.

**** Miscellaneous defaults.

#+begin_src emacs-lisp
  (use-package emacs
    :custom
    (inibit-startup-message +1)
    (ring-bell-function 'ignore)
    (large-file-warning-threshold 100000000)
    (load-prefer-newer +1)
    (confirm-kill-processes nil)
    (use-dialog-box nil)
    :config
    (scroll-bar-mode -1)
    (tool-bar-mode -1)
    (menu-bar-mode -1)
    (tooltip-mode -1)
    (set-fringe-mode 10)
    (column-number-mode +1)
    (size-indication-mode +1))
#+end_src

Highlight the current line.

#+begin_src emacs-lisp
  (use-package hl-line
    :hook
    ((after-init . global-hl-line-mode)
     ((dashboard-mode vterm-mode) . (lambda () (setq-local global-hl-line-mode nil)))))
#+end_src

Highlight undo and redos.

#+begin_src emacs-lisp
  (use-package undo-hl
    :straight (undo-hl :type git :host github :repo "casouri/undo-hl")
    :hook ((text-mode . undo-hl-mode)
           (prog-mode . undo-hl-mode))
    :custom-face
    (undo-hl-insert ((t (:background "#B6E63E"))))
    (undo-hl-delete ((t (:background "#FB2874")))))
#+end_src

Reduce the performance impact of long lines in a file (eg. minified files).

#+begin_src emacs-lisp
  (use-package so-long
    :hook (after-init . global-so-long-mode))
#+end_src

Always insert the closing pair of parenthesis, brackets, curly brackets, and double quotes.

#+begin_src emacs-lisp
  (use-package elec-pair
    :hook (after-init . electric-pair-mode))
#+end_src

Remember position in files.

#+begin_src emacs-lisp
  (use-package saveplace
    :hook (after-init . save-place-mode)
    :custom
    (save-place-forget-unreadable-files t))
#+end_src

**** Matching elements (parenthesis, quotes, etc).

[[https://github.com/Fanael/rainbow-delimiters][Rainbow-delimiters]] documentation.

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook ((prog-mode . rainbow-delimiters-mode)))

  (use-package paren
    :hook (after-init . show-paren-mode))
#+end_src

**** Whitespaces.

#+begin_src emacs-lisp
  (use-package whitespace
    :hook (after-init . global-whitespace-mode)
    :custom
    (whitespace-style '(face trailing empty space-after-tab space-before-tab)))
#+end_src

**** Save commands history.

#+begin_src emacs-lisp
  (use-package savehist
    :hook (after-init . savehist-mode)
    :custom
    (history-length 30)
    (savehist-autosave-interval 60)
    (savehist-additional-variables '(search-ring regexp-search-ring)))
#+end_src

**** Automatically revert buffers for files modified outside emacs.

Unless the buffer was modified inside emacs, always refresh buffers to use the latest file version. Also modify dired
to automatically refresh its content too.

#+begin_src emacs-lisp
  (use-package autorevert
    :hook (after-init . global-auto-revert-mode)
    :custom
    (global-auto-revert-non-file-buffers t))
#+end_src

**** Handle emacs backup files.

Put emacs backup and auto save files (~*~~ and ~#*#~) in cached folder to avoid polluting the source files directories.

#+begin_src emacs-lisp
  (let ((backup-dir (concat-path lec/var-directory "backups"))
        (auto-saves-dir (concat-path lec/var-directory "auto-saves")))
    (dolist (dir (list backup-dir auto-saves-dir))
      (when (not (file-directory-p dir))
        (make-directory dir t)))
    (setq backup-directory-alist `(("." . ,backup-dir))
          auto-save-file-name-transforms `((".*" ,auto-saves-dir t))
          auto-save-list-file-prefix (concat-path auto-saves-dir ".saves-")
          tramp-backup-directory-alist `((".*" . ,backup-dir))
          tramp-auto-save-directory auto-saves-dir))

  (setq auto-save-default t     ; Use auto-save feature
        auto-save-timeout 60    ; Save after 1min idle.
        auto-save-interval 100) ; Save every 100 characters typed.

  (setq backup-by-copying t     ; Don't delink hardlinks
        delete-old-versions t   ; Clean up the backups
        version-control t       ; Use version numbers on backups,
        kept-new-versions 5     ; keep some new versions
        kept-old-versions 2)    ; and some old ones, too
#+end_src

**** Change the location of the recent files

#+begin_src emacs-lisp
  (use-package recentf
    :hook (after-init . recentf-mode)
    :custom
    (recentf-save-file (concat-path lec/var-directory "recentf"))
    (recentf-max-saved-items 500)
    (recentf-max-menu-items 15)
    (recentf-auto-cleanup 'never)
    :config
    (add-to-list 'recentf-exclude lec/var-directory)
    (add-to-list 'recentf-exclude lec/etc-directory))
#+end_src

